{"extracted_information": "The CFTC provides access to Commitments of Traders (COT) reports through static files, a Public Reporting Environment (PRE), and an API. The PRE allows users to customize, search, filter, and download report data. Weekly reports are generally released in static format, while the PRE offers more interactive access and broader historical data.", "specifications": {"downloadable_formats": ["CSV", "RDF", "RSS", "TSV", "XML"], "static_file_formats": ["Comma Delimited (.txt)"], "report_types": ["Legacy (futures only, combined futures & options)", "Supplemental (13 select agricultural commodities, combined futures & options)", "Disaggregated (agriculture, petroleum, natural gas, electricity, metals; futures only, combined futures & options)", "Traders in Financial Futures (financial contracts; futures only, combined futures & options)"], "report_formats": ["Short format (reportable open interest, week-to-week changes, commercial/non-commercial holdings, spreading, percent of open interest, numbers of traders)", "Long format (includes short format data, groups by crop year, concentration of positions by largest four and eight traders)"]}, "pricing": {}, "features": [{"name": "COT Public Reporting Environment (PRE)", "description": "An interactive environment launched in October 2022 to customize, search, filter, and download weekly and historical report data. It provides an API for programmatic access.", "url": "https://publicreporting.cftc.gov/"}, {"name": "Static Report Files", "description": "Weekly COT reports released in static format, including viewable and historical compressed annual files.", "access_points": ["Disaggregated Reports (Long/Short Format HTML links, Comma Delimited .txt files)", "Traders in Financial Futures Reports (Long Format HTML links, Comma Delimited .txt files)", "Legacy Reports (Long/Short Format HTML links, Comma Delimited .txt files)"]}, {"name": "API Access", "description": "Provided via the COT Public Reporting Environment (PRE) for searching and filtering across columns (reporting date/week, commodity groups/subgroups/name, contract market name).", "endpoint": "Public Reporting APIs (specific endpoints not listed, but available through PRE)", "authentication": "No tokens currently required or provided. Access is generally successful without a token, provided API is not overused.", "contact_for_api_questions": "publicreporting@cftc.gov"}, {"name": "Email Notifications", "description": "Users can sign up for weekly COT announcement emails.", "signup_url": "https://service.govdelivery.com/accounts/USCFTC/subscriber/new"}], "statistics": {}, "temporal_info": {"release_schedule": "Generally published each Friday at 3:30 pm Eastern Time (US), using data from the preceding Tuesday. Holidays can affect the schedule, requiring consultation of the COT release schedule.", "historical_data_availability": {"Legacy_Report": "Back to January 15, 1986", "CIT_Report": "Back to January 3, 2006", "Disaggregated_Reports": "Back to June 13, 2006", "Traders_in_Financial_Futures_Reports": "Back to June 13, 2006"}, "historical_release_dates_list": "Not available; only release dates for the 13 months of reports published on the website are accessible."}, "geographical_data": {}, "references": [], "restrictions": ["CFTC does not publish information on how individual traders are classified in COT reports due to legal restraints (CEA Section 8 data and confidential business practices).", "For commodities with fewer than four active traders in a specific category, the trader count is suppressed to preserve confidentiality.", "Historical data is not updated once published ('backdated COT updates' are not performed).", "The CFTC does not analyze the data or make recommendations based on it.", "COT reports are released only once a week due to resource constraints.", "API usage is subject to not 'overusing' the API, implying implicit rate limiting."]}